0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// FIXED: kinematic pressure [m2/s2], not physical pressure [Pa].
// sedExnerFoam solves: div(U) = 0 and dU/dt + div(UU) = -grad(p) + div(nu*grad(U))
// The p here is p_physical/rho. This matches pimpleFoam convention.
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        // PRESERVED: fixes pressure reference to prevent singular system
        type            fixedValue;
        value           uniform 0;
    }

    seabed
    {
        // RENAMED from "bottom". zeroGradient preserved.
        type            zeroGradient;
    }

    cylinder
    {
        type            zeroGradient;
    }

    top
    {
        // RENAMED from "surface". zeroGradient on rigid-lid is correct.
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //