system/blockMeshDict
FoamFile
{
    version	 2.0;
    format	 ascii;
    class	 dictionary;
    object	 blockMeshDict;
}



scale	 1.0;

vertices
(
    (-0.75    0.205      0.001) //0
    ( 1       0.205      0.001) //1
    (-0.75    0.08       0.001) //2
    ( 1       0.08       0.001) //3
    (-0.75   -0.025      0.001) //4
    ( 1      -0.025      0.001) //5
    (-0.75   -0.1        0.001) //6
    ( 1      -0.1        0.001) //7
    (-0.75    0.205      0) //8
    ( 1       0.205      0) //9
    (-0.75    0.08       0) //10
    ( 1       0.08       0) //11
    (-0.75   -0.025      0) //12
    ( 1      -0.025      0) //13
    (-0.75   -0.1        0) //14
    ( 1      -0.1        0) //15
);

blocks
(
    hex (10 11 9 8 2 3 1 0)  (578 20  1) simpleGrading (1 3.9754 1) //0
    hex (12 13 11 10 4 5 3 2)  (578 35 1) simpleGrading (1  1     1) //1
    hex (14 15 13 12 6 7 5 4) (578 25  1) simpleGrading (1  1     1) //2 
);
 
edges
(
);

patches
(
    patch inlet
    (
        (4 12 10 2)
        (2 10 8 0)
    )
    patch outlet
    (
        (9 1 3 11)
	(11 3 5 13)
	(13 5 7 15)
    )
    symmetryPlane surface
    (
        (8 9 1 0)
    )
    wall bottom
    (
        (6 14 15 7)
        (6 14 12 4)
    )
    empty lateralfront
    (
        (6 7 5 4)
	(4 5 3 2)
	(2 3 1 0)
    )
    empty lateralback
    (
        (14 15 13 12)
	(12 13 11 10)
	(10 11 9 8)

    )
);

mergPatchPairs
(
);
